DataProcessors/PerformanceEstimation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<DataProcessor>
		<Properties>
			<Name>PerformanceEstimation</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>StartDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EndDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Chart</Name>
					<Type>
						<v8:Type>d7p1:Chart</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Step</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OverallSystemPerformance</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.KeyOperations</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Performance</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>KeyOperation</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.KeyOperations</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TargetTime</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Priority</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/TimeMeasurements.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>TimeMeasurements</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ExecutionTime</Name>
					<Comment>Execution time in seconds</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>DateRecords</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EndDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateRecordsLocal</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>KeyOperation</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.KeyOperations</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>MeasurementStartDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SessionNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/PerformanceEstimation/Forms/ExecutionHistory/Ext/Form/Module.bsl
#Region FormEventsHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Property("AutoTest") Then // Return if the form for analysis is received.
		Return;
	EndIf;
	
	KeyOperation = Parameters.HistorySettings.KeyOperation;
	StartDate = Parameters.HistorySettings.StartDate;
	EndDate = Parameters.HistorySettings.EndDate;
	Priority = KeyOperation.Priority;
	TargetTime = KeyOperation.TargetTime;
	
	Query = New Query;
	Query.SetParameter("KeyOperation", KeyOperation);
	Query.SetParameter("StartDate", StartDate);
	Query.SetParameter("EndDate", EndDate);
	
	Query.Text = 
	"SELECT
	|	TimeMeasurements.User AS User,
	|	TimeMeasurements.ExecutionTime AS Duration,
	|	TimeMeasurements.MeasurementStartDate AS EndTime
	|FROM
	|	InformationRegister.TimeMeasurements AS TimeMeasurements
	|WHERE
	|	TimeMeasurements.KeyOperation = &KeyOperation
	|	AND TimeMeasurements.MeasurementStartDate between &StartDate AND &EndDate
	|
	|ORDER BY
	|	EndTime";
	
	Selection = Query.Execute().Select();
	MeasurementsCountNumber = Selection.Count();
	MeasurementsCount = String(MeasurementsCountNumber) + ?(MeasurementsCountNumber < 100, " (NOT Enough)", "");
	
	While Selection.Next() Do
		
		HistoryRow = History.Add();
		FillPropertyValues(HistoryRow, Selection);
		
	EndDo;
	
EndProcedure

#EndRegion

#Region FormTableItemEventHandlersHistory

// Prohibits editing key operation from DataProcessors
// form so. internal mechanisms can be damaged.
//
&AtClient
Procedure KeyOperationOpen(Item, StandardProcessing)
	
	StandardProcessing = False;
	
EndProcedure

#EndRegion



// Rise { Popov N 2016-05-25
&AtClient
Function RiseGetFormInterfaceClient() Export
	Return RiseGetFormInterface();
EndFunction

&AtServer
Function RiseGetFormInterface()
	Return RiseTranslation.GetFormInterface(ThisForm);
EndFunction
// Rise } Popov N 2016-05-25
